Revit 2024 API
OverrideGraphicSettings.SurfaceBackgroundPatternColor Property
 The override color of the surface background pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public Color SurfaceBackgroundPatternColor { get; }
Visual Basic
Public ReadOnly Property SurfaceBackgroundPatternColor As Color
	Get
Visual C++
public:
property Color^ SurfaceBackgroundPatternColor {
	Color^ get ();
}
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace